Revit 2027 API
Document.IsModelInCloud Property
 Identifies if document is stored on Autodesk cloud services.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsModelInCloud { get; }
Public ReadOnly Property IsModelInCloud As Boolean
	Get
public:
property bool IsModelInCloud {
	bool get ();
}
member IsModelInCloud : bool with get
Property Value
Boolean
See Also
Reference
Document Class
Autodesk.Revit.DB Namespace